#### RebarHandlesData Members

---

|  |
| --- |
| RebarHandlesData Class   Methods   Properties   See Also |

The  RebarHandlesData  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | AddCustomHandle | Adds a new handle definition to the rebar. This information is set to the rebar after the API execution is finished successfully. |
| Public method | Dispose | Releases all resources used by the  RebarHandlesData |
| Public method | Equals | Determines whether the specified  Object  is equal to the current  Object  . (Inherited from  Object  .) |
| Public method | GetCustomHandles | Gets the handle definitions for the rebar that were added. |
| Public method | GetEndHandle | Gets the end handle tag. |
| Public method | GetHashCode | Serves as a hash function for a particular type. (Inherited from  Object  .) |
| Public method | GetStartHandle | Gets the start handle tag. |
| Public method | GetType | Gets the  Type  of the current instance. (Inherited from  Object  .) |
| Public method | SetEndHandle | Sets the end handle tag. This information is set to the rebar after the API execution is finished successfully. |
| Public method | SetStartHandle | Sets the start handle tag. This information is set to the rebar after the API execution is finished successfully. |
| Public method | ToString | Returns a string that represents the current object. (Inherited from  Object  .) |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also

RebarHandlesData Class

Autodesk.Revit.DB.Structure Namespace